<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the additonal content package called GarageBandBasicContent.pkg for Logic Pro X and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.portalpie.munki.GarageBandBasicContent</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GarageBandBasicContent</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/LogicProX</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>GarageBandBasicContent.pkg for Logic Pro X</string>
			<key>display_name</key>
			<string>GarageBandBasicContent</string>
			<key>minimum_os_version</key>
			<string>10.9</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>ParentRecipe</key>
	<string>com.github.portalpie.download.GarageBandBasicContent</string>
    <key>Process</key>
	<array>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>installs_item_paths</key>
                <array>
                    <string>/Library/Application Support/GarageBand/ChordTrainer/1. Major Open Chords.chtr</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>